InformationRegisters/Д_ДоступностьДокументовДокументооборота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>Д_ДоступностьДокументовДокументооборота</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Авторство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ознакомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращениеВТП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодтипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Д_ДоступностьДокументовДокументооборота/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ТипыДокументов = Метаданные.ПодпискиНаСобытия.ДокументыСогласуемыеПередЗаписью.Источник.Типы();
	//
	//Для каждого ТекДокумент Из ТипыДокументов Цикл
	//	ДокСсылка = Новый(ТекДокумент);
	//	Элементы.ТипДокумента.СписокВыбора.Добавить(ДокСсылка.Метаданные().Имя, ДокСсылка.Метаданные().Синоним);	
	//КонецЦикла; 
	
	Элементы.ТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.Д_ЗаявкаНаОплату.Имя, Метаданные.Документы.Д_ЗаявкаНаОплату.Синоним);
	Элементы.ТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.Д_ЗаявкаНаФинансирование.Имя, Метаданные.Документы.Д_ЗаявкаНаФинансирование.Синоним);
	Элементы.ТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.Д_СлужебнаяЗаписка.Имя, Метаданные.Документы.Д_СлужебнаяЗаписка.Синоним);
	Элементы.ТипДокумента.СписокВыбора.Добавить(Метаданные.Документы.Д_ЗаявкаНаСогласованиеДоговора.Имя, Метаданные.Документы.Д_ЗаявкаНаСогласованиеДоговора.Синоним);
	
	Если ЗначениеЗаполнено(Запись.ТипДокумента) И Элементы.ТипДокумента.СписокВыбора.НайтиПоЗначению(Запись.ТипДокумента) = Неопределено Тогда
		Элементы.ТипДокумента.СписокВыбора.Добавить(Запись.ТипДокумента);	
	КонецЕсли;
	ТипДокументаПриИзмененииСервер();
КонецПроцедуры


&НаКлиенте
Процедура ВсеДокументыПриИзменении(Элемент)
	Элементы.Авторство.Доступность = НЕ Запись.ВсеДокументы;
	Элементы.Согласование.Доступность = НЕ Запись.ВсеДокументы;
	Элементы.Исполнение.Доступность = НЕ Запись.ВсеДокументы;
	Элементы.Ознакомление.Доступность = НЕ Запись.ВсеДокументы;
	Элементы.Предприятия.Доступность = НЕ Запись.ВсеДокументы;
	Если НЕ Элемент = Неопределено Тогда
		Если Запись.ВсеДокументы Тогда
			Запись.Авторство = Истина;
			Запись.Согласование = Истина;
			Запись.Исполнение = Истина;
			Запись.Ознакомление = Истина;
			Запись.Предприятия = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВсеДокументыПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ТипДокументаПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТипДокументаПриИзмененииСервер()
	Подтипы = ПолучитьПодтипыДокумента(Запись.ТипДокумента);
	Элементы.ПодтипДокумента.Доступность = Подтипы.Количество();
	Элементы.ПодтипДокумента.СписокВыбора.ЗагрузитьЗначения(Подтипы);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодтипыДокумента(ИмяДокумента)
	
	Если ИмяДокумента = "Д_ЗаявкаНаОтгрузку" Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить("Спирт№1");
		МассивТипов.Добавить("Спирт№2");
		МассивТипов.Добавить("ПрочаяПродукция");
		Возврат МассивТипов;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Д_ВидыВнутреннихДокументов.Ссылка
		|ИЗ
		|	Справочник.Д_ВидыВнутреннихДокументов КАК Д_ВидыВнутреннихДокументов
		|ГДЕ
		|	НЕ Д_ВидыВнутреннихДокументов.Родитель = ЗНАЧЕНИЕ(Справочник.Д_ВидыВнутреннихДокументов.ПустаяСсылка)
		|	И Д_ВидыВнутреннихДокументов.ИмяДокумента = &ИмяДокумента";
		
		Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
		
		Результат = Запрос.Выполнить();
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецФункции // ()

&НаКлиенте
Процедура ПодтипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	а = 1;
	//СтандартнаяОбработка = Ложь;
	//Подтипы = ПолучитьПодтипыДокумента(Запись.ТипДокумента);
	//СписокЗначений = Новый СписокЗначений;
	//СписокЗначений.ЗагрузитьЗначения(Подтипы);
	//ВыбратьИзСписка(СписокЗначений);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Запись.ПодтипДокумента) ИЛИ НЕ Элементы.ПодтипДокумента.Доступность Тогда
		Запись.ПодтипДокумента = Неопределено;	
	КонецЕсли;
КонецПроцедуры
